Revit 2026 API

# ElectricalDemandFactorDefinitionSetValues Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValues(
	ICollection<ElectricalDemandFactorValue> values
)
```
```vb
Public Sub SetValues (
	values As ICollection(Of ElectricalDemandFactorValue)
)
```
```cpp
public:
void SetValues(
	ICollection<ElectricalDemandFactorValue^>^ values
)
```
```fsharp
member SetValues :
        values : ICollection<ElectricalDemandFactorValue> -> unit
```

#### Parameters

values ICollectionElectricalDemandFactorValue

#### Reference

ElectricalDemandFactorDefinition Class

Autodesk.Revit.DB.Electrical Namespace